<!-- filepath: c:\Users\dnsco\code\consultant_internship\Consultant-Internship\FrontendConsultantInternship\smart-franchize-website\src\components\AboutFranchising.vue -->
<template>
  <div>
    <h1>Q/A<br>о франчайзинге</h1>
    <div class="container">
      <div v-for="(section, sectionIndex) in sections" :key="sectionIndex" class="section">
        <h2>{{ section.title }}</h2>
        <div class="dropdown">
          <div v-for="(item, index) in section.items" :key="item.id" class="dropdown">
            <button class="dropdown-button" @click="toggleDropdown(sectionIndex, index)">
              <span class="icon" :class="{ 'rotated': item.isOpen }">></span>
              {{ item.title }}
            </button>
            <transition name="slide">
              <div v-show="item.isOpen" class="dropdown-content">
                <div v-html="item.content"></div>
              </div>
            </transition>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'AboutFranchising',
  data() {
    return {
      sections: [
        {
          title: "Общие вопросы о франчайзинге кофеен",
          items: [
            {
              id: 1,
              title: "Что такое франчайзинг кофейни и как он работает?",
              content: `
                <p>
                  <strong>Франчайзинг</strong> – это бизнес-модель, при которой франчайзи (покупатель франшизы) получает право работать под брендом франчайзера (владельца сети) по готовой бизнес-системе.<br>
                  Франчайзер предоставляет технологию, стандарты, обучение, маркетинг, а франчайзи инвестирует и ведет бизнес, выплачивая роялти.
                </p>
                <p><strong>Как это работает?</strong></p>
                <ol>
                <li><strong>Франчайзи</strong> покупает франшизу (платит <strong>паушальный взнос</strong> - это единовременный платеж, который франчайзи выплачивает франчайзеру при заключении договора франчайзинга, чтобы получить право вести бизнес под его брендом).</li>
                <li>
                  <strong>Франчайзер</strong> предоставляет:
                  <ul>
                    <li>Бренд и фирменный стиль.</li>
                    <li>Технологии приготовления кофе и стандарты обслуживания.</li>
                    <li>Помощь в подборе помещения, обучении персонала, маркетинге.</li>
                  </ul>
                </li>
                <li><strong>Франчайзи</strong> открывает кофейню, соблюдая правила сети, и платит <strong>роялти</strong> (ежемесячный процент от выручки).</li>
                </ol>
              `,
              isOpen: false
            },
            {
              id: 2,
              title: "Какие преимущества у франчайзинга перед самостоятельным открытием кофейни?",
              content: `
                <ul>
                  <li>Готовый бренд и узнаваемость.</li>
                  <li>Проверенная бизнес-модель и поддержка.</li>
                  <li>Обучение и помощь в подборе локации.</li>
                  <li>Готовые поставщики и рецептуры.</li>
                  <li>Меньше рисков по сравнению с самостоятельным стартом.</li>
                </ul>
              `,
              isOpen: false
            },
            {
              id: 3,
              title: "Какие риски есть у франчайзи в кофейном бизнесе?",
              content: `
                <ul>
                  <li>Высокая конкуренция в некоторых локациях.</li>
                  <li>Зависимость от репутации сети.</li>
                  <li>Обязательные платежи (роялти, маркетинговые взносы).</li>
                  <li>Ограничения в управлении (меню, дизайн, цены).</li>
                </ul>
              `,
              isOpen: false
            },
            {
              id: 4,
              title: "Сколько стоит купить франшизу кофейни?",
              content: `
                <ul>
                  <li><strong>Известные бренды:</strong> в среднем от 5 000 0000 рублей до 10 000 000 рублей (и более).</li>
                  <li><strong>Средние сети (Россия, СНГ):</strong> 1–10 млн рублей.</li>
                  <li><strong>Новые проекты:</strong> от 500 тыс. до 3 млн рублей.</li>
                </ul>
              `,
              isOpen: false
            },
            {
              id: 5,
              title: "Как выбрать надежную франшизу кофейни?",
              content: `
                <ul>
                  <li>Проверить опыт франчайзера (сколько точек, как давно работает).</li>
                  <li>Изучить отзывы других франчайзи.</li>
                  <li>Проверить условия договора (роялти, срок окупаемости).</li>
                  <li>Оценить уровень поддержки (обучение, маркетинг).</li>
                </ul>
              `,
              isOpen: false
            }
          ]
        },
        {
          title: "Экономические аспекты",
          items: [
            {
              id: 6,
              title: "Какие первоначальные инвестиции нужны для открытия франшизы кофейни?",
              content: `
                <ul>
                  <li>Паушальный взнос - это единовременный платеж, который франчайзи выплачивает франчайзеру при заключении договора франчайзинга, чтобы получить право вести бизнес под его брендом.</li>
                  <li>Аренда и ремонт помещения.</li>
                  <li>Оборудование и стартовые запасы.</li>
                  <li>Маркетинг и оформление документов.</li>
                </ul>
              `,
              isOpen: false
            },
            {
              id: 7,
              title: "Как быстро окупается франшиза кофейни?",
              content: `
              <strong>Показатели окупаемости варьируются от типа кофейни:</strong>
                <ul>
                  <li><strong>Кофейни с собой (takeaway):</strong> 6–18 месяцев.</li>
                  <li><strong>Фулл-формат (кафе):</strong> 1,5–3 года.</li>
                </ul>
              `,
              isOpen: false
            },
            {
              id: 8,
              title: "Можно ли получить кредит или господдержку на открытие франчайзинговой кофейни?",
                content: `
                <p>
                  Да, некоторые банки (Сбербанк, ВТБ) и государственные программы (например, "Франчайзинг от МСП (Малого и среднего предпринимательства)") поддерживают франчайзинговые проекты.<br>
                  Государство активно участвует в развитии бизнеса и помогает получить льготное кредитование. До 2030 года действует нацпроект «Малое и среднее предпринимательство». Заручиться господдержкой могут компании, входящие в Единый реестр субъектов МСП и работающие в приоритетных отраслях. К ним относятся розничная торговля, туризм, сельское хозяйство, ресторанный бизнес, медицина, образование и другие.
                </p>
                <p>
                  <strong>Таким образом, существуют следующие варианты финансирования бизнеса на начальном этапе:</strong>
                </p>
                <ul>
                  <li><strong>Банковский кредит</strong> (Сбербанк, ВТБ, Тинькофф) – под 12–20% годовых.</li>
                  <li><strong>Госпрограммы</strong> (например, "Франчайзинг" от МСП – льготные займы).</li>
                  <li><strong>Субсидии от территориального образования</strong> (например, в Москве – до 5 млн руб. на социальный бизнес).</li>
                </ul>
                `,
              isOpen: false
            }
          ]
        },
        {
          title: "Важные аспекты для начала работы по франшизе кофейни",
          items: [
            {
              id: 9,
              title: "Как франчайзер помогает с выбором места для кофейни?",
                content: `
                <ul>
                  <li>Анализ проходимости рядом с кофейней.</li>
                  <li>Анализ конкурентов в районе местонахождения кофейни.</li>
                  <li>Проверка арендной ставки.</li>
                  <li>Одобрение локации перед открытием.</li>
                </ul>
              `,
              isOpen: false
            },
            {
              id: 10,
              title: "Как выбрать место для открытия кофейни?",
              content: `
                <ol>
                  <li><strong>Анализ локации</strong><br>
                    Изучите карту города: ищите места с высоким трафиком (метро, ТЦ, ВУЗы, парки) или районы без кофеен, но с потенциальным спросом.
                  </li>
                  <li><strong>Постоянный мониторинг</strong><br>
                    Удачные места редко пустуют, но арендаторы могут освобождать помещения. Следите за объявлениями или просите знакомых сообщать о свободных площадях.
                  </li>
                  <li><strong>Формат кофейни</strong>
                    <ul>
                      <li>Навынос (или takeaway) – низкие затраты, высокая проходимость (у метро, офисов).</li>
                      <li>С посадочными местами – требует больше вложений, но привлекает посетителей надолго.</li>
                    </ul>
                  </li>
                  <li><strong>Борьба за хорошее место</strong><br>
                    Если помещение занято, предложите арендодателю более выгодные условия, предварительно оценив потенциальную доходность бизнеса.
                  </li>
                  <li><strong>Высокая аренда ≠ риск</strong><br>
                    Дорогая, но проходная локация может окупиться. Обратите внимание на то, что наличие конкурентов подтверждает платежеспособный спрос.
                  </li>
                  <li><strong>Совместные проекты</strong><br>
                    Рассмотрите сотрудничество с магазинами, библиотеками или книжными – это снизит стартовые затраты.
                  </li>
                </ol>
              `,
              isOpen: false
            },
            {
              id: 11,
              title: "Какие требования к помещению выдвигают франчайзеры?",
                content: `
                <strong>Как правило, франчайзеры выдвигают следующие основные требования к помещению под кофейню:</strong>
                <ul>
                  <li>Площадь (от 15–20 м² для takeaway, от 50 м² для полноформатного кафе)</li>
                  <li>Наличие коммуникаций (вода, электричество, вентиляция)</li>
                  <li>Соответствие корпоративному дизайну</li>
                </ul>
              `,
              isOpen: false
            },
            {
              id: 12,
              title: "Сколько времени занимает открытие кофейни по франшизе?",
              content: `
                <p>В среднем открытие кофейни по франшизе займет от 1 месяца (для формата takeaway) до 6 месяцев (полноформатное кафе).</p>
              `,
              isOpen: false
            },
            {
              id: 13,
              title: "Нужен ли опыт в ресторанном бизнесе, чтобы открыть франшизу кофейни?",
                content: `
                  <p>Нет, так как франчайзер обучает ведению бизнеса, но опыт в продажах или управлении будет явным преимуществом, так как поможет быстрее раскрутить бизнес.</p>
                  <p><strong>Без опыта можно, но:</strong></p>
                  <ul>
                    <li>Требуется готовность обучаться</li>
                    <li>Желателен опыт в розничных продажах или управлении</li>
                    <li>Важны организаторские способности</li>
                  </ul>
                  <p><strong>Как компенсировать отсутствие опыта:</strong></p>
                  <ul>
                    <li>Выбирать франшизы с полным циклом поддержки</li>
                    <li>Нанять управляющего с профильным образованием (дополнительные расходы)</li>
                    <li>Пройти курсы менеджмента</li>
                  </ul>
              `,
              isOpen: false
            },
            {
              id: 14,
                title: "Какое обучение предоставляет франчайзер?",
                content: `
                  <p>Как правило, франчайзер предоставляет обучение по следующим направлениям:</p>
                  <ul>
                    <li>Технология приготовления кофе</li>
                    <li>Стандарты обслуживания</li>
                    <li>Управление бизнесом и отчетность</li>
                  </ul>
              `,
              isOpen: false
            }
          ]
        },
        {
          title: "Юридические вопросы",
          items: [
            {
              id: 15,
              title: "Какие документы нужны для покупки франшизы кофейни?",
                content: `
                  <strong>1. Документы для заключения договора франчайзинга</strong>
                  <ul>
                  <li><strong>Для физического лица (ИП или самозанятого):</strong>
                    <ul>
                    <li>Паспорт РФ.</li>
                    <li>ИНН.</li>
                    <li>Свидетельство о регистрации ИП (если есть).</li>
                    <li>Выписка из ЕГРИП (для ИП).</li>
                    <li>Заявление на подключение к франшизе (по форме франчайзера).</li>
                    </ul>
                  </li>
                  <li><strong>Для юридического лица (ООО):</strong>
                    <ul>
                    <li>Устав и учредительные документы.</li>
                    <li>Выписка из ЕГРЮЛ (не старше 30 дней).</li>
                    <li>Протокол/решение о назначении директора.</li>
                    <li>Паспорт и ИНН руководителя.</li>
                    <li>Доверенность (если подписывает не гендиректор).</li>
                    </ul>
                  </li>
                  <li><strong>Дополнительно могут запросить:</strong>
                    <ul>
                    <li>Финансовые документы (подтверждение платежеспособности).</li>
                    <li>Бизнес-план или обоснование выбора локации.</li>
                    <li>Рекомендации (если есть опыт в общепите).</li>
                    </ul>
                  </li>
                  </ul>
                  <strong>2. Документы для открытия кофейни (после покупки франшизы)</strong>
                  <p>После подписания договора нужно оформить разрешительные документы для работы:</p>
                  <ul>
                  <li><strong>Регистрация бизнеса:</strong>
                    <ul>
                    <li>Если нет ИП/ООО – зарегистрироваться (выбрать код ОКВЭД, например, 56.10, 56.30).</li>
                    <li>Уведомление Роспотребнадзора о начале деятельности.</li>
                    </ul>
                  </li>
                  <li><strong>Документы для общепита:</strong>
                    <ul>
                    <li>Договор аренды (или свидетельство о собственности помещения).</li>
                    <li>Санэпидзаключение (СЭЗ) на помещение.</li>
                    <li>Разрешение Роспотребнадзора.</li>
                    <li>Декларация соответствия на продукцию (если требуется).</li>
                    <li>Медкнижки для сотрудников.</li>
                    <li>Договоры на вывоз мусора, дезинфекцию, дератизацию и другие.</li>
                    </ul>
                  </li>
                  <li><strong>Для работы по франшизе:</strong>
                    <ul>
                    <li>Подписанный договор франчайзинга.</li>
                    <li>Инструкции и стандарты сети (выдает франчайзер).</li>
                    <li>Сертификаты, подтверждающие права на результаты интеллектуальной деятельности и бренд.</li>
                    </ul>
                  </li>
                  </ul>
              `,
              isOpen: false
            },
            {
              id: 16,
              title: "Можно ли изменить дизайн или меню, если работаешь по франшизе?",
                content: `
                  <p>Обычно нет – франшиза предполагает единый стандарт. Но некоторые франчайзеры допускают локальные акции, поэтому необходим анализ конкретного договора.</p>
              `,
              isOpen: false
            },
            {
              id: 17,
              title: "Что будет, если нарушить условия договора франчайзинга?",
                content: `
                  <p>Если нарушить условия договора франчайзинга, возможны:</p>
                  <ul>
                  <li><strong>Штрафы</strong> (неустойка по договору).</li>
                  <li><strong>Расторжение договора</strong> франчайзером.</li>
                  <li><strong>Запрет на использование бренда</strong> и ноу-хау.</li>
                  <li><strong>Взыскание убытков</strong> через суд.</li>
                  <li><strong>Репутационные потери</strong> и утрата инвестиций.</li>
                  </ul>
                  <p>Точные последствия зависят от условий договора.</p>
              `,
              isOpen: false
            },
            {
              id: 18,
              title: "Как расторгнуть договор франшизы, если бизнес \"не пошел\"?",
                content: `
                  <p><strong>Условия расторжения:</strong></p>
                  <ul>
                  <li>По соглашению сторон</li>
                  <li>Через суд при нарушениях франчайзера</li>
                  <li>По окончании срока договора</li>
                  </ul>
                  <p><strong>Важно:</strong> Большинство договоров предусматривают запрет на аналогичный бизнес в радиусе 1-3 км в течение 2 лет.</p>
              `,
              isOpen: false
            }
          ]
        }
      ]
    };
  },
  methods: {
    toggleDropdown(sectionIndex, itemIndex) {
      this.sections[sectionIndex].items[itemIndex].isOpen = !this.sections[sectionIndex].items[itemIndex].isOpen;
    }
  }
};
</script>

<style scoped>
h1 {
  font-family: 'Tektur';
  font-size: 40px;
  font-weight: 500;
}

.container {
  max-width: 1200px;
  width: 100%;
  text-align: start;
}

h2 {
  position: relative;
  font-family: 'Tektur';
  font-size: 30px;
  height: 60px;
  align-content: center;

  background-color: #EEE2D4;
  font-weight: 500;
  padding-left: 25px;
  border-radius: 20px;
  border: 1px solid #ccc;
}

.dropdown {
  width: 100%;
  margin: 20px;
}

.dropdown-button {
  border: none;
  display: flex;
  align-items: center;
  font-size: 26px;
  font-weight: 400;
  gap: 8px;
  padding: 10px 15px;
  background: white;
  cursor: pointer;
  transition: all 0.3s;
}

.icon {
  transition: transform 0.3s;
  font-size: 26px;
  color: #836645;
}

.rotated {
  transform: rotate(90deg);
}

.dropdown-content {
  text-align: left;
  margin: 10px;
  padding: 20px 30px;
  border: 6px solid #91582F;
  border-radius: 20px;
}

p {
  font-size: 22px;
  border-radius: 20px;
  padding: 50px 30px;
}

/* Анимация выпадающего блока */
.slide-enter-active,
.slide-leave-active {
  transition: all 0.3s ease;
}

.slide-enter-from,
.slide-leave-to {
  opacity: 0;
  transform: translateY(-10px);
}
</style>